export const ALPHABET = [ 
    [[ 'あ', 'а', 0 ],
    [ 'い', 'и', 0 ],
    [ 'う', 'у', 0 ],
    [ 'え', 'э', 0 ],
    [ 'お', 'о', 0 ],],

    [[ 'か', 'ка', 0 ],
    [ 'き', 'ки', 0 ],
    [ 'く', 'ку', 0 ],
    [ 'け', 'кэ', 0 ],
    [ 'こ', 'ко', 0 ],],

    [[ 'さ', 'са', 0 ],
    [ 'し', 'си', 0 ],
    [ 'す', 'су', 0 ],
    [ 'せ', 'сэ', 0 ],
    [ 'そ', 'со', 0 ],],

    [[ 'た', 'та', 0 ],
    [ 'ち', 'ти', 0 ],
    [ 'つ', 'цу', 0 ],
    [ 'て', 'тэ', 0 ],
    [ 'と', 'то', 0 ],],
    
    [[ 'な', 'на', 0 ],
    [ 'に', 'ни', 0 ],
    [ 'ぬ', 'ну', 0 ],
    [ 'ね', 'нэ', 0 ],
    [ 'の', 'но', 0 ],],

    [[ 'は', 'ха', 0 ],
    [ 'ひ', 'хи', 0 ],
    [ 'ふ', 'ху', 0 ],
    [ 'へ', 'хэ', 0 ],
    [ 'ほ', 'хо', 0 ],],

    [[ 'ま', 'ма', 0 ],
    [ 'み', 'ми', 0 ],
    [ 'む', 'му', 0 ],
    [ 'め', 'мэ', 0 ],
    [ 'も', 'мо', 0 ],],

    [[ 'ら', 'ра', 0 ],
    [ 'り', 'ри', 0 ],
    [ 'る', 'ру', 0 ],
    [ 'れ', 'рэ', 0 ],
    [ 'ろ', 'ро', 0 ],]
  ];

export const KANJI = [
  [['人', 'человек', 'ひと'], 
  ['学生', 'студент', 'がく・せい'],
  ['元気', 'healthy; lively', 'げん・き'],
  ['友達 ', 'friend', 'とも・だち'],
  ['子', 'ребенок', 'こ'],
  ['小', 'маленький', 'ちいさい'],
  ['中', 'середина, внутри', 'なか'],
  ['大', 'большой', 'おお.きい']],

  [['生', 'жизнь', 'いきる'],
  ['先', 'before, ahead, previous, future', 'さき'],
  ['学', 'study, learning, science', 'まなぶ'],
  ['高', 'high', 'たかい'],
  ['車', 'car, vehicle', 'くるま'],
  ['供', 'submit, offer, present, serve (meal), accompany', 'そな.える / とも'],
  ['達', 'достичь', 'たち']],

  [['これ', 'this', ''], 
  ['それ ', 'that', ''],
  ['彼', 'там (далеко)', 'あれ'],
  ['こう  ', '(things are) this way', ''],
  ['そう ', '(things are) that way', ''],
  ['大人', 'adult', 'おとな'],
  ['子供 ', 'child', 'こども']],

  [['先生', 'teacher', 'せんせい'],
  ['学校', 'school', 'がっこう'],
  ['小学校', 'elementary school', 'しょうがっこう'],
  ['中学校', 'middle school', 'ちゅうがっこう'],
  ['高校', 'high school', 'こうこう'],
  ['大学', 'college', 'だいがく']]
];

export const KATAKANA = [ 
  [[ 'ア', 'а', 0 ],
  [ 'イ', 'и', 0 ],
  [ 'ウ', 'у', 0 ],
  [ 'エ', 'э', 0 ],
  [ 'オ', 'о', 0 ],],

  [[ 'カ', 'ка', 0 ],
  [ 'キ', 'ки', 0 ],
  [ 'ク', 'ку', 0 ],
  [ 'ケ', 'кэ', 0 ],
  [ 'コ', 'ко', 0 ],],

  [[ 'サ', 'са', 0 ],
  [ 'シ', 'си', 0 ],
  [ 'ス', 'су', 0 ],
  [ 'セ', 'сэ', 0 ],
  [ 'ソ', 'со', 0 ],],

  [[ 'タ', 'та', 0 ],
  [ 'チ', 'ти', 0 ],
  [ 'ツ', 'цу', 0 ],
  [ 'テ', 'тэ', 0 ],
  [ 'ト', 'то', 0 ],],
  
  [[ 'ナ', 'на', 0 ],
  [ 'ニ', 'ни', 0 ],
  [ 'ヌ', 'ну', 0 ],
  [ 'ネ', 'нэ', 0 ],
  [ 'ノ', 'но', 0 ],],

  [[ 'ハ', 'ха', 0 ],
  [ 'ヒ', 'хи', 0 ],
  [ 'フ', 'ху', 0 ],
  [ 'ヘ', 'хэ', 0 ],
  [ 'ホ', 'хо', 0 ],],

  [[ 'マ', 'ма', 0 ],
  [ 'ミ', 'ми', 0 ],
  [ 'ム', 'му', 0 ],
  [ 'メ', 'мэ', 0 ],
  [ 'モ', 'мо', 0 ],],

  [[ 'ラ', 'ра', 0 ],
  [ 'リ', 'ри', 0 ],
  [ 'ル', 'ру', 0 ],
  [ 'レ', 'рэ', 0 ],
  [ 'ロ', 'ро', 0 ],]
];
